# Reference Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..Reference Property
GroupTypeId Class See Also
---
Reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId Reference { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Reference As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Reference {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace